chipKIT32/chipKIT-core/pic32/cores/pic32/harmony/framework/peripheral/usb/processor/usb_p32mz0512efk144.h
PLIB_INLINE_API void _PLIB_UNSUPPORTED PLIB_USB_OperatingModeSelect(USB_MODULE_ID index, USB_OPMODES opMode)
{
    switch (index) {
        case USB_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API bool PLIB_USB_ExistsOpModeSelect(USB_MODULE_ID index)
{
    switch (index) {
        case USB_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API void _PLIB_UNSUPPORTED PLIB_USB_ResumeSignalingEnable(USB_MODULE_ID index)
{
    switch (index) {
        case USB_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API void _PLIB_UNSUPPORTED PLIB_USB_ResumeSignalingDisable(USB_MODULE_ID index)
{
    switch (index) {
        case USB_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API bool PLIB_USB_ExistsResumeSignaling(USB_MODULE_ID index)
{
    switch (index) {
        case USB_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API void _PLIB_UNSUPPORTED PLIB_USB_PingPongFreeze(USB_MODULE_ID index)
{
    switch (index) {
        case USB_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API void _PLIB_UNSUPPORTED PLIB_USB_PingPongUnfreeze(USB_MODULE_ID index)
{
    switch (index) {
        case USB_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API void _PLIB_UNSUPPORTED PLIB_USB_PingPongReset(USB_MODULE_ID index)
{
    switch (index) {
        case USB_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API bool PLIB_USB_ExistsBufferFreeze(USB_MODULE_ID index)
{
    switch (index) {
        case USB_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API void _PLIB_UNSUPPORTED PLIB_USB_SOFEnable(USB_MODULE_ID index)
{
    switch (index) {
        case USB_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API void _PLIB_UNSUPPORTED PLIB_USB_SOFDisable(USB_MODULE_ID index)
{
    switch (index) {
        case USB_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API bool PLIB_USB_ExistsStartOfFrames(USB_MODULE_ID index)
{
    switch (index) {
        case USB_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API void _PLIB_UNSUPPORTED PLIB_USB_TokenSpeedSelect(USB_MODULE_ID index, USB_TOKEN_SPEED tokenSpeed)
{
    switch (index) {
        case USB_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API bool PLIB_USB_ExistsNextTokenSpeed(USB_MODULE_ID index)
{
    switch (index) {
        case USB_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API void _PLIB_UNSUPPORTED PLIB_USB_DeviceAddressSet(USB_MODULE_ID index, uint8_t address)
{
    switch (index) {
        case USB_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API uint8_t _PLIB_UNSUPPORTED PLIB_USB_DeviceAddressGet(USB_MODULE_ID index)
{
    switch (index) {
        case USB_NUMBER_OF_MODULES :
        default :
            return (uint8_t)0;
    }
}

PLIB_INLINE_API bool PLIB_USB_ExistsDeviceAddress(USB_MODULE_ID index)
{
    switch (index) {
        case USB_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API uint16_t _PLIB_UNSUPPORTED PLIB_USB_FrameNumberGet(USB_MODULE_ID index)
{
    switch (index) {
        case USB_NUMBER_OF_MODULES :
        default :
            return (uint16_t)0;
    }
}

PLIB_INLINE_API bool PLIB_USB_ExistsFrameNumber(USB_MODULE_ID index)
{
    switch (index) {
        case USB_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API USB_PID _PLIB_UNSUPPORTED PLIB_USB_TokenPIDGet(USB_MODULE_ID index)
{
    switch (index) {
        case USB_NUMBER_OF_MODULES :
        default :
            return (USB_PID)0;
    }
}

PLIB_INLINE_API void _PLIB_UNSUPPORTED PLIB_USB_TokenPIDSet(USB_MODULE_ID index, USB_PID pidValue)
{
    switch (index) {
        case USB_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API void _PLIB_UNSUPPORTED PLIB_USB_TokenSend(USB_MODULE_ID index, USB_PID pidValue, uint8_t endpoint, uint8_t deviceAddress, bool isLowSpeed)
{
    switch (index) {
        case USB_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API bool PLIB_USB_ExistsTokenPID(USB_MODULE_ID index)
{
    switch (index) {
        case USB_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API uint8_t _PLIB_UNSUPPORTED PLIB_USB_TokenEPGet(USB_MODULE_ID index)
{
    switch (index) {
        case USB_NUMBER_OF_MODULES :
        default :
            return (uint8_t)0;
    }
}

PLIB_INLINE_API void _PLIB_UNSUPPORTED PLIB_USB_TokenEPSet(USB_MODULE_ID index, uint8_t epValue)
{
    switch (index) {
        case USB_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API bool PLIB_USB_ExistsTokenEP(USB_MODULE_ID index)
{
    switch (index) {
        case USB_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API uint8_t _PLIB_UNSUPPORTED PLIB_USB_SOFThresholdGet(USB_MODULE_ID index)
{
    switch (index) {
        case USB_NUMBER_OF_MODULES :
        default :
            return (uint8_t)0;
    }
}

PLIB_INLINE_API void _PLIB_UNSUPPORTED PLIB_USB_SOFThresholdSet(USB_MODULE_ID index, uint8_t threshold)
{
    switch (index) {
        case USB_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API bool PLIB_USB_ExistsSOFThreshold(USB_MODULE_ID index)
{
    switch (index) {
        case USB_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API void* _PLIB_UNSUPPORTED PLIB_USB_BDTBaseAddressGet(USB_MODULE_ID index)
{
    switch (index) {
        case USB_NUMBER_OF_MODULES :
        default :
            return (void*)0;
    }
}

PLIB_INLINE_API void _PLIB_UNSUPPORTED PLIB_USB_BDTBaseAddressSet(USB_MODULE_ID index, void* address)
{
    switch (index) {
        case USB_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API bool PLIB_USB_ExistsBDTBaseAddress(USB_MODULE_ID index)
{
    switch (index) {
        case USB_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

